In [75]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Pandas
DataFrame (Excel -> Table)
Series (Excel -> Column)

In [76]:
s1=pd.Series([1,2,3,4,5])
print(s1)
s2=pd.Series((1,2,3,4,5))
print(s2)
s3=pd.Series([1,2,3,4,5],index=['A','B','C','D','E'],name='aplha')
s3.index.name='beta'

s3

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

beta
A    1
B    2
C    3
D    4
E    5
Name: aplha, dtype: int64

In [77]:
d1={
    'A':[1,2,3],
    'B':[3,2,1],
    'C':[5,6,7]
}
d1

{'A': [1, 2, 3], 'B': [3, 2, 1], 'C': [5, 6, 7]}

In [78]:
Data=[[1,'ali','urdu',12],
          [2,'khan','english',13],
          [3,'shahir','arabic',14],
          [4,'dildar','french',15]]
Data

[[1, 'ali', 'urdu', 12],
 [2, 'khan', 'english', 13],
 [3, 'shahir', 'arabic', 14],
 [4, 'dildar', 'french', 15]]

In [79]:
df1=pd.DataFrame(Data)
df1

   0       1        2   3
0  1     ali     urdu  12
1  2    khan  english  13
2  3  shahir   arabic  14
3  4  dildar   french  15

In [80]:
df1=pd.DataFrame(Data,columns=['ID','Name','course','Fee'],index=range(1,5))
df1

   ID    Name   course  Fee
1   1     ali     urdu   12
2   2    khan  english   13
3   3  shahir   arabic   14
4   4  dildar   french   15

# List of tupple

In [81]:
dta=((1,'ali','ai',1500),
     (2,'sher','iot',1200),
     (3,'khan','ai',1300),
     (4,'mir','cnc',1100))
dta

((1, 'ali', 'ai', 1500),
 (2, 'sher', 'iot', 1200),
 (3, 'khan', 'ai', 1300),
 (4, 'mir', 'cnc', 1100))

In [82]:
df_1=pd.DataFrame(dta)
df_1

   0     1    2     3
0  1   ali   ai  1500
1  2  sher  iot  1200
2  3  khan   ai  1300
3  4   mir  cnc  1100

In [83]:
df_1=pd.DataFrame(dta,columns=['id','name','course','fee'],index=range(19,23))
df_1

    id  name course   fee
19   1   ali     ai  1500
20   2  sher    iot  1200
21   3  khan     ai  1300
22   4   mir    cnc  1100

In [84]:
dic={
    'id':[1,2,3,4,5],
    'name':['mehr','tube','qureshi','nisar','wasim'],
    'course':['ai','cnc','ml','dl','it'],
    'fee':[1222,1123,11342,2124,2443]
}
dic

{'id': [1, 2, 3, 4, 5],
 'name': ['mehr', 'tube', 'qureshi', 'nisar', 'wasim'],
 'course': ['ai', 'cnc', 'ml', 'dl', 'it'],
 'fee': [1222, 1123, 11342, 2124, 2443]}

In [85]:
df_2=pd.DataFrame(dic,index=['i','ii','iii','iv','v'])
df_2

     id     name course    fee
i     1     mehr     ai   1222
ii    2     tube    cnc   1123
iii   3  qureshi     ml  11342
iv    4    nisar     dl   2124
v     5    wasim     it   2443

In [86]:
df1=pd.DataFrame(
    np.random.randint(1,100, size = (100,5)),
    columns=['a','b','c','d','e'])

df1.head(4)

    a   b   c   d   e
0  20  30   1   4  25
1   2  93  44  14  81
2  50  10  84  75  85
3   3  88  59   8   9

# Dictinary of series

In [87]:

d1 = {"A":pd.Series([1,2,3]),
     "B":pd.Series([3,3,5])}
pd.DataFrame(d1)

   A  B
0  1  3
1  2  3
2  3  5

# Get General Infromation from your DataFrame

In [88]:
dta_x={'id':[1,2,3,4,5],
     'name':['ali','sher',np.nan,'mir','wasim'],
     'course':['ai','iot','5g',np.nan,'cnc'],
     'fee':[1222,12323,1234,453,34532]}
df_x=pd.DataFrame(dta_x)
df_x

   id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532

In [89]:
#dataframe.info() #dataframe.describe() #dataframe.dtypes #dataframe.columns
#dataframe.index #dataframe.values #dataframe.isnull() #dataframe.isnull().sum() 
#dataframe.notnull() #dataframe.notnull().sum() #dataframe.head(n=5) #dataframe.tail() 
#dataframe.apply() # pass user define function

In [90]:
df_x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
id        5 non-null int64
name      4 non-null object
course    4 non-null object
fee       5 non-null int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [91]:
print(df_x.describe())

             id           fee
count  5.000000      5.000000
mean   3.000000   9952.800000
std    1.581139  14596.621722
min    1.000000    453.000000
25%    2.000000   1222.000000
50%    3.000000   1234.000000
75%    4.000000  12323.000000
max    5.000000  34532.000000

In [92]:
df_x.columns

Index(['id', 'name', 'course', 'fee'], dtype='object')

In [93]:
df_x.isnull()

      id   name  course    fee
0  False  False   False  False
1  False  False   False  False
2  False   True   False  False
3  False  False    True  False
4  False  False   False  False

In [94]:
df_x.index

RangeIndex(start=0, stop=5, step=1)

In [95]:
df_x.values

array([[1, 'ali', 'ai', 1222],
       [2, 'sher', 'iot', 12323],
       [3, nan, '5g', 1234],
       [4, 'mir', nan, 453],
       [5, 'wasim', 'cnc', 34532]], dtype=object)

In [96]:
df_x.describe()

             id           fee
count  5.000000      5.000000
mean   3.000000   9952.800000
std    1.581139  14596.621722
min    1.000000    453.000000
25%    2.000000   1222.000000
50%    3.000000   1234.000000
75%    4.000000  12323.000000
max    5.000000  34532.000000

In [97]:
df_x.cumsum

<bound method DataFrame.cumsum of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [98]:
df_x.idxmax

<bound method DataFrame.idxmax of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [99]:
df_x.aggregate

<bound method DataFrame.aggregate of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [100]:
df_x.isnull().sum()

id        0
name      1
course    1
fee       0
dtype: int64

In [101]:
df_x.align

<bound method DataFrame.align of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [102]:
df_x.asfreq

<bound method NDFrame.asfreq of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [103]:
df_x.at_time

<bound method NDFrame.at_time of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [104]:
df_x.notnull

<bound method DataFrame.notnull of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [105]:
df_x.apply

<bound method DataFrame.apply of    id   name course    fee
0   1    ali     ai   1222
1   2   sher    iot  12323
2   3    NaN     5g   1234
3   4    mir    NaN    453
4   5  wasim    cnc  34532>

In [106]:
df_x.tail(2)

   id   name course    fee
3   4    mir    NaN    453
4   5  wasim    cnc  34532

In [107]:
df_x[df_x.id<=2.5]

   id  name course    fee
0   1   ali     ai   1222
1   2  sher    iot  12323

In [108]:
#add a new column
df_x['updated fee']=0
print(df_x)
df_x['updated fee']=333445
df_x

   id   name course    fee  updated fee
0   1    ali     ai   1222            0
1   2   sher    iot  12323            0
2   3    NaN     5g   1234            0
3   4    mir    NaN    453            0
4   5  wasim    cnc  34532            0

   id   name course    fee  updated fee
0   1    ali     ai   1222       333445
1   2   sher    iot  12323       333445
2   3    NaN     5g   1234       333445
3   4    mir    NaN    453       333445
4   5  wasim    cnc  34532       333445

In [109]:
df_x.Timing=40
df_x

   id   name course    fee  updated fee
0   1    ali     ai   1222       333445
1   2   sher    iot  12323       333445
2   3    NaN     5g   1234       333445
3   4    mir    NaN    453       333445
4   5  wasim    cnc  34532       333445

In [110]:
print(df_x.name.map)
print(df_x.course.map)

<bound method Series.map of 0      ali
1     sher
2      NaN
3      mir
4    wasim
Name: name, dtype: object>
<bound method Series.map of 0     ai
1    iot
2     5g
3    NaN
4    cnc
Name: course, dtype: object>

In [111]:
dtf={}
for i , v in enumerate(df_x.course.unique()):
    dtf[v]=i
dtf

{'ai': 0, 'iot': 1, '5g': 2, nan: 3, 'cnc': 4}

In [112]:
df_x.name.value_counts()

ali      1
sher     1
wasim    1
mir      1
Name: name, dtype: int64

In [113]:
df_x.fee.sum()

49764

In [114]:
df_x.mad

<bound method NDFrame._add_numeric_operations.<locals>.mad of    id   name course    fee  updated fee
0   1    ali     ai   1222       333445
1   2   sher    iot  12323       333445
2   3    NaN     5g   1234       333445
3   4    mir    NaN    453       333445
4   5  wasim    cnc  34532       333445>

# APPLY FUNCTION

In [115]:
df_x

   id   name course    fee  updated fee
0   1    ali     ai   1222       333445
1   2   sher    iot  12323       333445
2   3    NaN     5g   1234       333445
3   4    mir    NaN    453       333445
4   5  wasim    cnc  34532       333445

In [116]:
def f1(x):
    if x=='ai':
        return 2123
    elif x=='iot':
        return 33442
    elif x=='5g':
        return 883
    elif x=='NaN':
        return 0
    elif x=='cnc':
        return 34344
    else:
        return 'none'
df_x.course.apply(f1)

0     2123
1    33442
2      883
3     none
4    34344
Name: course, dtype: object

In [117]:
df_x['updated course']=df_x.course.apply(f1)
df_x

   id   name course    fee  updated fee updated course
0   1    ali     ai   1222       333445           2123
1   2   sher    iot  12323       333445          33442
2   3    NaN     5g   1234       333445            883
3   4    mir    NaN    453       333445           none
4   5  wasim    cnc  34532       333445          34344

In [118]:
df_y=pd.DataFrame(np.random.randint(1,30,size=(4,5)),columns=['A','B','C','D','E'])
df_y

    A   B   C   D   E
0  25  17  21  13  12
1  14  11  20  24  11
2  18   2  21  14  16
3  23   8  14  29  24

In [119]:
df_z=pd.concat([df_y,df_x], axis=0,sort=False)# if you see this warning apply sort=False FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
                                            #of pandas will change to not sort by default.
df_z

,A,B,C,D,E,id,name,course,fee,updated fee,updated course
0,25.0,17.0,21.0,13.0,12.0,NaN,NaN,NaN,NaN,NaN,NaN
1,14.0,11.0,20.0,24.0,11.0,NaN,NaN,NaN,NaN,NaN,NaN
2,18.0,2.0,21.0,14.0,16.0,NaN,NaN,NaN,NaN,NaN,NaN
3,23.0,8.0,14.0,29.0,24.0,NaN,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,1.0,ali,ai,1222.0,333445.0,2123
1,NaN,NaN,NaN,NaN,NaN,2.0,sher,iot,12323.0,333445.0,33442
2,NaN,NaN,NaN,NaN,NaN,3.0,NaN,5g,1234.0,333445.0,883
3,NaN,NaN,NaN,NaN,NaN,4.0,mir,NaN,453.0,333445.0,none
4,NaN,NaN,NaN,NaN,NaN,5.0,wasim,cnc,34532.0,333445.0,34344

In [120]:
df_z=pd.concat([df_y,df_x], axis=1)
df_z

,A,B,C,D,E,id,name,course,fee,updated fee,updated course
0,25.0,17.0,21.0,13.0,12.0,1,ali,ai,1222,333445,2123
1,14.0,11.0,20.0,24.0,11.0,2,sher,iot,12323,333445,33442
2,18.0,2.0,21.0,14.0,16.0,3,NaN,5g,1234,333445,883
3,23.0,8.0,14.0,29.0,24.0,4,mir,NaN,453,333445,none
4,NaN,NaN,NaN,NaN,NaN,5,wasim,cnc,34532,333445,34344

In [121]:
df_z['total']=df_z.A+ df_z.B+ df_z.C+ df_z.C+ df_z.E
df_z

,A,B,C,D,E,id,name,course,fee,updated fee,updated course,total
0,25.0,17.0,21.0,13.0,12.0,1,ali,ai,1222,333445,2123,96.0
1,14.0,11.0,20.0,24.0,11.0,2,sher,iot,12323,333445,33442,76.0
2,18.0,2.0,21.0,14.0,16.0,3,NaN,5g,1234,333445,883,78.0
3,23.0,8.0,14.0,29.0,24.0,4,mir,NaN,453,333445,none,83.0
4,NaN,NaN,NaN,NaN,NaN,5,wasim,cnc,34532,333445,34344,NaN

In [122]:
df_z ['percentage']=(df_z.A+df_z.B+df_z.C+df_z.D+df_z.E)/500*100
def grade(y):
    if y>=80:
        return 'A'
    elif y>=70:
        return 'B'
    elif y>=60:
        return 'C'
    elif y>=50:
        return 'D'
    else:
        return 'Fail'
df_z['Grade']=df_z.percentage.apply(grade)
df_z

,A,B,C,D,E,id,name,course,fee,updated fee,updated course,total,percentage,Grade
0,25.0,17.0,21.0,13.0,12.0,1,ali,ai,1222,333445,2123,96.0,17.6,Fail
1,14.0,11.0,20.0,24.0,11.0,2,sher,iot,12323,333445,33442,76.0,16.0,Fail
2,18.0,2.0,21.0,14.0,16.0,3,NaN,5g,1234,333445,883,78.0,14.2,Fail
3,23.0,8.0,14.0,29.0,24.0,4,mir,NaN,453,333445,none,83.0,19.6,Fail
4,NaN,NaN,NaN,NaN,NaN,5,wasim,cnc,34532,333445,34344,NaN,NaN,Fail

In [123]:
def usr_f(course,c1,c2,c3,c4,c5):
    if course=="ai":
        return np.array(['c1','c2','c3','c4','c5']).sum()
    elif course=="5g":
        return np.array(['c1','c2','c3','c4','c5']).prod()
    elif course=="iot":
        return sum(np.array(['c1','c2','c3','c4','c5']).cumsum())

In [124]:
df_z[['course','A','B','C','D','E']]

  course     A     B     C     D     E
0     ai  25.0  17.0  21.0  13.0  12.0
1    iot  14.0  11.0  20.0  24.0  11.0
2     5g  18.0   2.0  21.0  14.0  16.0
3    NaN  23.0   8.0  14.0  29.0  24.0
4    cnc   NaN   NaN   NaN   NaN   NaN

In [205]:

#df_z[["course","A","B","C","D","E"]].apply(lambda x:usr_f(*x),axis=1)
#df_z

# Sort 
*index
*value

In [131]:
df_z.sort_index(ascending = False)

,A,B,C,D,E,id,name,course,fee,updated fee,updated course,total,percentage,Grade
4,NaN,NaN,NaN,NaN,NaN,5,wasim,cnc,34532,333445,34344,NaN,NaN,Fail
3,23.0,8.0,14.0,29.0,24.0,4,mir,NaN,453,333445,none,83.0,19.6,Fail
2,18.0,2.0,21.0,14.0,16.0,3,NaN,5g,1234,333445,883,78.0,14.2,Fail
1,14.0,11.0,20.0,24.0,11.0,2,sher,iot,12323,333445,33442,76.0,16.0,Fail
0,25.0,17.0,21.0,13.0,12.0,1,ali,ai,1222,333445,2123,96.0,17.6,Fail

In [135]:
df_z.sort_index(ascending=False,axis=1)

,updated fee,updated course,total,percentage,name,id,fee,course,Grade,E,D,C,B,A
0,333445,2123,96.0,17.6,ali,1,1222,ai,Fail,12.0,13.0,21.0,17.0,25.0
1,333445,33442,76.0,16.0,sher,2,12323,iot,Fail,11.0,24.0,20.0,11.0,14.0
2,333445,883,78.0,14.2,NaN,3,1234,5g,Fail,16.0,14.0,21.0,2.0,18.0
3,333445,none,83.0,19.6,mir,4,453,NaN,Fail,24.0,29.0,14.0,8.0,23.0
4,333445,34344,NaN,NaN,wasim,5,34532,cnc,Fail,NaN,NaN,NaN,NaN,NaN

# sort
sort_values("")

sort_values(by=[c1,c2,c3],ascending=[true,true,false])

In [138]:
df_z.sort_values('name')

,A,B,C,D,E,id,name,course,fee,updated fee,updated course,total,percentage,Grade
0,25.0,17.0,21.0,13.0,12.0,1,ali,ai,1222,333445,2123,96.0,17.6,Fail
3,23.0,8.0,14.0,29.0,24.0,4,mir,NaN,453,333445,none,83.0,19.6,Fail
1,14.0,11.0,20.0,24.0,11.0,2,sher,iot,12323,333445,33442,76.0,16.0,Fail
4,NaN,NaN,NaN,NaN,NaN,5,wasim,cnc,34532,333445,34344,NaN,NaN,Fail
2,18.0,2.0,21.0,14.0,16.0,3,NaN,5g,1234,333445,883,78.0,14.2,Fail

In [142]:
df_z.sort_values(by=['name','total','percentage'],ascending=[False,True,False])

,A,B,C,D,E,id,name,course,fee,updated fee,updated course,total,percentage,Grade
4,NaN,NaN,NaN,NaN,NaN,5,wasim,cnc,34532,333445,34344,NaN,NaN,Fail
1,14.0,11.0,20.0,24.0,11.0,2,sher,iot,12323,333445,33442,76.0,16.0,Fail
3,23.0,8.0,14.0,29.0,24.0,4,mir,NaN,453,333445,none,83.0,19.6,Fail
0,25.0,17.0,21.0,13.0,12.0,1,ali,ai,1222,333445,2123,96.0,17.6,Fail
2,18.0,2.0,21.0,14.0,16.0,3,NaN,5g,1234,333445,883,78.0,14.2,Fail

In [146]:
df_z.sort_values(by=['course','percentage'],ascending=[True,False])

,A,B,C,D,E,id,name,course,fee,updated fee,updated course,total,percentage,Grade
2,18.0,2.0,21.0,14.0,16.0,3,NaN,5g,1234,333445,883,78.0,14.2,Fail
0,25.0,17.0,21.0,13.0,12.0,1,ali,ai,1222,333445,2123,96.0,17.6,Fail
4,NaN,NaN,NaN,NaN,NaN,5,wasim,cnc,34532,333445,34344,NaN,NaN,Fail
1,14.0,11.0,20.0,24.0,11.0,2,sher,iot,12323,333445,33442,76.0,16.0,Fail
3,23.0,8.0,14.0,29.0,24.0,4,mir,NaN,453,333445,none,83.0,19.6,Fail

In [158]:
#Data loading
Data_T=pd.read_csv("./titanic/test.csv")
Data_T.info()
Data_T.head(5)
Data_T.sort_values(by=['Sex','Age','Fare','Ticket','Cabin'],ascending=[True,True,True ,False,False])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
354,1246,3,"Dean, Miss. Elizabeth Gladys Millvina""""",female,0.17,1,2,C.A. 2315,20.5750,NaN,S
250,1142,2,"West, Miss. Barbara J",female,0.92,1,2,C.A. 34651,27.7500,NaN,S
263,1155,3,"Klasen, Miss. Gertrud Emilia",female,1.00,1,1,350405,12.1833,NaN,S
117,1009,3,"Sandstrom, Miss. Beatrice Irene",female,1.00,1,1,PP 9549,16.7000,G6,S
296,1188,2,"Laroche, Miss. Louise",female,1.00,1,2,SC/Paris 2123,41.5792,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
41,933,1,"Franklin, Mr. Thomas Parham",male,NaN,0,0,113778,26.5500,D34,S
290,1182,1,"Rheims, Mr. George Alexander Lucien",male,NaN,0,0,PC 17607,39.6000,NaN,S
146,1038,1,"Hilliard, Mr. Herbert Henry",male,NaN,0,0,17463,51.8625,E46,S
39,931,3,"Hee, Mr. Ling",male,NaN,0,0,1601,56.4958,NaN,S
342,1234,3,"Sage, Mr. John George",male,NaN,1,9,CA. 2343,69.5500,NaN,S

In [208]:
Data_T=pd.read_csv("./titanic/test.csv")
Data_T['TotalFare']=Data_T.Fare
Data_T

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,TotalFare
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,7.8292
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,7.0000
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,9.6875
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,8.6625
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,12.2875
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,8.0500
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,108.9000
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,7.2500
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,8.0500
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,22.3583

In [163]:
Data_T.TotalFare.sum()

14856.5376

In [169]:
Data_T.Pclass.sum()

947

In [172]:
Data_T.Cabin.map

<bound method Series.map of 0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
413     NaN
414    C105
415     NaN
416     NaN
417     NaN
Name: Cabin, Length: 418, dtype: object>

In [174]:
Data_T.Ticket.map

<bound method Series.map of 0                  330911
1                  363272
2                  240276
3                  315154
4                 3101298
              ...
413             A.5. 3236
414              PC 17758
415    SOTON/O.Q. 3101262
416                359309
417                  2668
Name: Ticket, Length: 418, dtype: object>

In [204]:
Data_T.sort_values('PassengerId',ascending =True)
Data_T.PassengerId

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [206]:
Data_T.sort_index(ascending=True,axis=1)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Ticket,TotalFare
0,34.5,NaN,Q,7.8292,"Kelly, Mr. James",0,892,3,male,0,330911,7.8292
1,47.0,NaN,S,7.0000,"Wilkes, Mrs. James (Ellen Needs)",0,893,3,female,1,363272,7.0000
2,62.0,NaN,Q,9.6875,"Myles, Mr. Thomas Francis",0,894,2,male,0,240276,9.6875
3,27.0,NaN,S,8.6625,"Wirz, Mr. Albert",0,895,3,male,0,315154,8.6625
4,22.0,NaN,S,12.2875,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,896,3,female,1,3101298,12.2875
...,...,...,...,...,...,...,...,...,...,...,...,...
413,NaN,NaN,S,8.0500,"Spector, Mr. Woolf",0,1305,3,male,0,A.5. 3236,8.0500
414,39.0,C105,C,108.9000,"Oliva y Ocana, Dona. Fermina",0,1306,1,female,0,PC 17758,108.9000
415,38.5,NaN,S,7.2500,"Saether, Mr. Simon Sivertsen",0,1307,3,male,0,SOTON/O.Q. 3101262,7.2500
416,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,1308,3,male,0,359309,8.0500
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,2668,22.3583

In [211]:
Data_T.describe

<bound method NDFrame.describe of      PassengerId  Pclass                                          Name  \
0            892       3                              Kelly, Mr. James
1            893       3              Wilkes, Mrs. James (Ellen Needs)
2            894       2                     Myles, Mr. Thomas Francis
3            895       3                              Wirz, Mr. Albert
4            896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..           ...     ...                                           ...
413         1305       3                            Spector, Mr. Woolf
414         1306       1                  Oliva y Ocana, Dona. Fermina
415         1307       3                  Saether, Mr. Simon Sivertsen
416         1308       3                           Ware, Mr. Frederick
417         1309       3                      Peter, Master. Michael J

        Sex   Age  SibSp  Parch              Ticket      Fare Cabin Embarked  \
0      male  34.5      0      0              330911    7.8292   NaN        Q
1    female  47.0      1      0              363272    7.0000   NaN        S
2      male  62.0      0      0              240276    9.6875   NaN        Q
3      male  27.0      0      0              315154    8.6625   NaN        S
4    female  22.0      1      1             3101298   12.2875   NaN        S
..      ...   ...    ...    ...                 ...       ...   ...      ...
413    male   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  female  39.0      0      0            PC 17758  108.9000  C105        C
415    male  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416    male   NaN      0      0              359309    8.0500   NaN        S
417    male   NaN      1      1                2668   22.3583   NaN        C

     TotalFare
0       7.8292
1       7.0000
2       9.6875
3       8.6625
4      12.2875
..         ...
413     8.0500
414   108.9000
415     7.2500
416     8.0500
417    22.3583

[418 rows x 12 columns]>

In [213]:
Data_T.isnull

<bound method DataFrame.isnull of      PassengerId  Pclass                                          Name  \
0            892       3                              Kelly, Mr. James
1            893       3              Wilkes, Mrs. James (Ellen Needs)
2            894       2                     Myles, Mr. Thomas Francis
3            895       3                              Wirz, Mr. Albert
4            896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..           ...     ...                                           ...
413         1305       3                            Spector, Mr. Woolf
414         1306       1                  Oliva y Ocana, Dona. Fermina
415         1307       3                  Saether, Mr. Simon Sivertsen
416         1308       3                           Ware, Mr. Frederick
417         1309       3                      Peter, Master. Michael J

        Sex   Age  SibSp  Parch              Ticket      Fare Cabin Embarked  \
0      male  34.5      0      0              330911    7.8292   NaN        Q
1    female  47.0      1      0              363272    7.0000   NaN        S
2      male  62.0      0      0              240276    9.6875   NaN        Q
3      male  27.0      0      0              315154    8.6625   NaN        S
4    female  22.0      1      1             3101298   12.2875   NaN        S
..      ...   ...    ...    ...                 ...       ...   ...      ...
413    male   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  female  39.0      0      0            PC 17758  108.9000  C105        C
415    male  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416    male   NaN      0      0              359309    8.0500   NaN        S
417    male   NaN      1      1                2668   22.3583   NaN        C

     TotalFare
0       7.8292
1       7.0000
2       9.6875
3       8.6625
4      12.2875
..         ...
413     8.0500
414   108.9000
415     7.2500
416     8.0500
417    22.3583

[418 rows x 12 columns]>

In [214]:
Data_T.notnull

<bound method DataFrame.notnull of      PassengerId  Pclass                                          Name  \
0            892       3                              Kelly, Mr. James
1            893       3              Wilkes, Mrs. James (Ellen Needs)
2            894       2                     Myles, Mr. Thomas Francis
3            895       3                              Wirz, Mr. Albert
4            896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..           ...     ...                                           ...
413         1305       3                            Spector, Mr. Woolf
414         1306       1                  Oliva y Ocana, Dona. Fermina
415         1307       3                  Saether, Mr. Simon Sivertsen
416         1308       3                           Ware, Mr. Frederick
417         1309       3                      Peter, Master. Michael J

        Sex   Age  SibSp  Parch              Ticket      Fare Cabin Embarked  \
0      male  34.5      0      0              330911    7.8292   NaN        Q
1    female  47.0      1      0              363272    7.0000   NaN        S
2      male  62.0      0      0              240276    9.6875   NaN        Q
3      male  27.0      0      0              315154    8.6625   NaN        S
4    female  22.0      1      1             3101298   12.2875   NaN        S
..      ...   ...    ...    ...                 ...       ...   ...      ...
413    male   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  female  39.0      0      0            PC 17758  108.9000  C105        C
415    male  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416    male   NaN      0      0              359309    8.0500   NaN        S
417    male   NaN      1      1                2668   22.3583   NaN        C

     TotalFare
0       7.8292
1       7.0000
2       9.6875
3       8.6625
4      12.2875
..         ...
413     8.0500
414   108.9000
415     7.2500
416     8.0500
417    22.3583

[418 rows x 12 columns]>

In [242]:
Data_T.iloc[:5,:7]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch
0,892,3,"Kelly, Mr. James",male,34.5,0,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1

In [250]:
Data_T.iloc[1,[1,3,7,9,3]]

Pclass         3
Sex       female
Ticket    363272
Cabin        NaN
Sex       female
Name: 1, dtype: object